; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p15---int100n150-m25---int100c150---s487---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level29 level24 level53)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level30 level24 level54)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level31 level24 level55)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level32 level24 level56)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level33 level24 level57)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level34 level24 level58)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level35 level24 level59)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level36 level24 level60)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level37 level24 level61)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level38 level24 level62)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level39 level24 level63)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level40 level24 level64)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level41 level24 level65)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level42 level24 level66)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level43 level24 level67)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level44 level24 level68)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level45 level24 level69)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level46 level24 level70)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level47 level24 level71)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level48 level24 level72)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level18 level67)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level49 level24 level73)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level18 level68)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level50 level24 level74)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level18 level69)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level51 level24 level75)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level18 level70)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level52 level24 level76)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level18 level71)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level53 level24 level77)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level18 level72)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level54 level24 level78)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level18 level73)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level55 level24 level79)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level18 level74)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level56 level24 level80)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level18 level75)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level57 level24 level81)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level18 level76)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level58 level24 level82)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level18 level77)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level59 level24 level83)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level18 level78)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level60 level24 level84)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level18 level79)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level61 level24 level85)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level18 level80)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level62 level24 level86)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level18 level81)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level63 level24 level87)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level18 level82)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level64 level24 level88)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level18 level83)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level65 level24 level89)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level18 level84)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level66 level24 level90)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level18 level85)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level67 level24 level91)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level18 level86)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level68 level24 level92)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level18 level87)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level69 level24 level93)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level18 level88)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level70 level24 level94)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level18 level89)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level71 level24 level95)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level18 level90)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level72 level24 level96)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level18 level91)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level73 level24 level97)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level18 level92)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level74 level24 level98)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level18 level93)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level75 level24 level99)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level76 level18 level94)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level76 level24 level100)
(sum level77 level6 level83)
(sum level77 level8 level85)
(sum level77 level18 level95)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level77 level24 level101)
(sum level78 level6 level84)
(sum level78 level8 level86)
(sum level78 level18 level96)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level78 level24 level102)
(sum level79 level6 level85)
(sum level79 level8 level87)
(sum level79 level18 level97)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level80 level6 level86)
(sum level80 level8 level88)
(sum level80 level18 level98)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level81 level6 level87)
(sum level81 level8 level89)
(sum level81 level18 level99)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level82 level6 level88)
(sum level82 level8 level90)
(sum level82 level18 level100)
(sum level82 level20 level102)
(sum level83 level6 level89)
(sum level83 level8 level91)
(sum level83 level18 level101)
(sum level84 level6 level90)
(sum level84 level8 level92)
(sum level84 level18 level102)
(sum level85 level6 level91)
(sum level85 level8 level93)
(sum level86 level6 level92)
(sum level86 level8 level94)
(sum level87 level6 level93)
(sum level87 level8 level95)
(sum level88 level6 level94)
(sum level88 level8 level96)
(sum level89 level6 level95)
(sum level89 level8 level97)
(sum level90 level6 level96)
(sum level90 level8 level98)
(sum level91 level6 level97)
(sum level91 level8 level99)
(sum level92 level6 level98)
(sum level92 level8 level100)
(sum level93 level6 level99)
(sum level93 level8 level101)
(sum level94 level6 level100)
(sum level94 level8 level102)
(sum level95 level6 level101)
(sum level96 level6 level102)

(connected l0 l1)
(fuelcost level6 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l1 l0)
(fuelcost level6 l1 l0)
(connected l1 l2)
(fuelcost level20 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level20 l2 l1)
(connected l2 l3)
(fuelcost level18 l2 l3)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level18 l3 l2)

(at t0 l0)
(fuel t0 level102)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l3)
(at p3 l0)
(at p4 l3)
(at p5 l3)
(at p6 l3)
(at p7 l1)
(at p8 l3)
(at p9 l1)
(at p10 l0)
(at p11 l3)
(at p12 l3)
(at p13 l1)
(at p14 l1)
)

(:goal
(and
(at p0 l3)
(at p1 l3)
(at p2 l0)
(at p3 l2)
(at p4 l0)
(at p5 l2)
(at p6 l0)
(at p7 l2)
(at p8 l1)
(at p9 l3)
(at p10 l1)
(at p11 l0)
(at p12 l2)
(at p13 l0)
(at p14 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 15
2. (drive t0 l0 l3 level94 level8 level102)
   deleted: (at t0 l0) (fuel t0 level102)
   added: (at t0 l3) (fuel t0 level94)
   goals met: 0 of 15
3. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 0 of 15
4. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 15
5. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 15
6. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 15
7. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 15
8. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 0 of 15
9. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 15
10. (drive t0 l3 l1 level73 level21 level94)
   deleted: (at t0 l3) (fuel t0 level94)
   added: (at t0 l1) (fuel t0 level73)
   goals met: 0 of 15
11. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 1 of 15
12. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 2 of 15
13. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 2 of 15
14. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 2 of 15
15. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 2 of 15
16. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 2 of 15
17. (drive t0 l1 l0 level67 level6 level73)
   deleted: (at t0 l1) (fuel t0 level73)
   added: (at t0 l0) (fuel t0 level67)
   goals met: 2 of 15
18. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 3 of 15
19. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 4 of 15
20. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 5 of 15
21. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 6 of 15
22. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 7 of 15
23. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 7 of 15
24. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 7 of 15
25. (drive t0 l0 l2 level43 level24 level67)
   deleted: (at t0 l0) (fuel t0 level67)
   added: (at t0 l2) (fuel t0 level43)
   goals met: 7 of 15
26. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 7 of 15
27. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 8 of 15
28. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 9 of 15
29. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 10 of 15
30. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 11 of 15
31. (drive t0 l2 l3 level25 level18 level43)
   deleted: (at t0 l2) (fuel t0 level43)
   added: (at t0 l3) (fuel t0 level25)
   goals met: 11 of 15
32. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 12 of 15
33. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 13 of 15
34. (unload p14 t0 l3)
   deleted: (in p14 t0)
   added: (at p14 l3)
   goals met: 14 of 15
35. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 15 of 15
